src/Catalogs/ИсточникХраненияДС/ИсточникХраненияДС.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ИсточникХраненияДС</name>
  <owners>Catalog.Семья</owners>
  <attributes>
    <name>Дата</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидДС</name>
    <type>
      <types>EnumRef.Вид_ДС</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмяКарты</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Банк</name>
    <type>
      <types>CatalogRef.Банк</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерКарты</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>19</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СрокДействия</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РасчетныйСчет</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>24</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Лимит</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Активна</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Catalog>

src/Enums/Вид_ДС/Вид_ДС.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>Вид_ДС</name>
  <enumValues>
    <name>Наличные</name>
  </enumValues>
  <enumValues>
    <name>РСБезналичные</name>
  </enumValues>
  <enumValues>
    <name>Электронные</name>
  </enumValues>
  <enumValues>
    <name>Кредитные</name>
  </enumValues>
  <enumValues>
    <name>КартаБезналичные</name>
  </enumValues>
</mdclass:Enum>

src/Catalogs/ИсточникХраненияДС/Forms/ФормаЭлемента/Module.bsl
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	УстановкаВидимостиФормы();
КонецПроцедуры

&НаКлиенте
Процедура УстановкаВидимостиФормы()
	Если  Объект.ВидДС = ПредопределенноеЗначение("Перечисление.Вид_ДС.Кредитные")  Тогда
		Элементы.Лимит.Видимость = Истина;
	Иначе
		Элементы.Лимит.Видимость = Ложь;
	КонецЕсли;
КонецПроцедуры
